_posts/2022-01-23-boj-5904.html
---
title: BOJ 5904 Moo 게임
tag: 분할정복
---

<div id="outline-container-orgaf4d294" class="outline-2">
<h2 id="orgaf4d294">BOJ 5904 Moo 게임</h2>
<div class="outline-text-2" id="text-orgaf4d294">
<ul class="org-ul">
<li>생각을 많이 하게 만드는 문제</li>
</ul>
</div>
</div>

<div id="outline-container-orge82a9ba" class="outline-2">
<h2 id="orge82a9ba">접근하기</h2>
<div class="outline-text-2" id="text-orge82a9ba">
<pre class="example">

Moo
Moo Moo o Moo
...

이렇게 확장되는 규칙에서 N이 주어질 때, N번째 문자 맞추기


1. 분할정복 style풀기 - recursive
2. iterative로 풀기

</pre>
</div>
</div>

<div id="outline-container-org9c3b886" class="outline-2">
<h2 id="org9c3b886">코드 - recursive style</h2>
<div class="outline-text-2" id="text-org9c3b886">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">str</span>[4] = {<span style="color: #ad7fa8; font-style: italic;">'m'</span>, <span style="color: #ad7fa8; font-style: italic;">'o'</span>, <span style="color: #ad7fa8; font-style: italic;">'o'</span>, <span style="color: #ad7fa8; font-style: italic;">'\0'</span>};

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">f</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">k</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">len</span>)
{
    <span style="color: #729fcf; font-weight: bold;">if</span> (n&lt;=3) {
        printf(<span style="color: #ad7fa8; font-style: italic;">"%c\n"</span>, str[n-1]);
        <span style="color: #729fcf; font-weight: bold;">return</span>;
    }

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">new_len</span> = len*2 + (3 + k);

    <span style="color: #729fcf; font-weight: bold;">if</span> (n &gt; new_len) {
        f(n, k+1, new_len);
    } <span style="color: #729fcf; font-weight: bold;">else</span> { <span style="color: #888a85;">// </span><span style="color: #888a85;">n &lt;= new_len</span>
        <span style="color: #729fcf; font-weight: bold;">if</span> (n &gt; len &amp;&amp; n&lt;= (len + k + 3)) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (n - len == 1)
               printf(<span style="color: #ad7fa8; font-style: italic;">"m\n"</span>); 
            <span style="color: #729fcf; font-weight: bold;">else</span>
               printf(<span style="color: #ad7fa8; font-style: italic;">"o\n"</span>); 
            <span style="color: #729fcf; font-weight: bold;">return</span> ;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            f(n - (len + k + 3), 1, 3);
        }   
    }
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    f(N, 1, 3);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org09849c5" class="outline-2">
<h2 id="org09849c5">코드 - iteratvie style</h2>
<div class="outline-text-2" id="text-org09849c5">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">new_len</span> = 3;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">mid_len</span> = 3;

    <span style="color: #729fcf; font-weight: bold;">while</span>(new_len &lt; N) {
        new_len = new_len*2 + (++mid_len);
    }

    <span style="color: #729fcf; font-weight: bold;">while</span>(1) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">size</span> = (new_len - mid_len) / 2;
        <span style="color: #888a85;">// </span><span style="color: #888a85;">1st</span>
        <span style="color: #729fcf; font-weight: bold;">if</span> (size &gt;= N) {
            mid_len--;
            new_len = size;
        } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (size + mid_len &lt; N) {
            N = N - (size + mid_len);
            mid_len--;
            new_len = size;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            N = N - size;
            <span style="color: #729fcf; font-weight: bold;">break</span>;
        }
        <span style="color: #888a85;">// </span><span style="color: #888a85;">3rd</span>
    }

    <span style="color: #729fcf; font-weight: bold;">if</span> (N == 1) 
        printf(<span style="color: #ad7fa8; font-style: italic;">"m\n"</span>);
    <span style="color: #729fcf; font-weight: bold;">else</span>
        printf(<span style="color: #ad7fa8; font-style: italic;">"o\n"</span>);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbfd645c" class="outline-2">
<h2 id="orgbfd645c">문제 링크</h2>
<div class="outline-text-2" id="text-orgbfd645c">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/5904">https://www.acmicpc.net/problem/5904</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf9c514e" class="outline-2">
<h2 id="orgf9c514e">풀이참고</h2>
<div class="outline-text-2" id="text-orgf9c514e">
<ul class="org-ul">
<li><a href="https://david0506.tistory.com/68">https://david0506.tistory.com/68</a></li>
<li><a href="https://bconfiden2.tistory.com/277">https://bconfiden2.tistory.com/277</a></li>
</ul>
</div>
</div>
